package firstprj;

public class A6 {

	public static void main(String[] args) {
		System.out.println("1.머신러닝(Machine learning) : 머신러닝은 2000년대에 들어서 시작된 인공지능을 구현하는 방법의 하나로 빅데이터를 스스로 분석하고, 그 내용을 바탕으로 결론을 도출하는 기술이다.\n"
				+"2.딥러닝(Deep Learning) : 딥러닝은 머신러닝보다 더 작은 개념으로 ‘신경망’을 통해 인공지능을 만드는 머신러닝의 한 종류이다.\n"
				+ "3.MQTT(Message Queuing Telemetry Transport) : 사물통신, 사물인터넷과 같이 대역폭이 제한된 통신 환경에 최적화하여 개발된 푸시 기술 기반의 경량 메시지 전송 프로토콜이다.\n"
				+ "4.혼합현실(Mixed Reality) : 혼합현실은 현실을 기반으로 가상 정보를 부가하는 증강현실과 가상환경에 현실 정보를 부가하는 증각 가상의 의미를 포함한다.\n"
				+ "5.데이터 리터러시(Data Literacy) : 데이터 리터러시는 빅데이터 속에서 목적에 맞게 필요한 정보를 취합하고 그 안에서 패턴을 읽어내는 능력이다.\n"
				+ "6.오피니언 마이닝(Opinion Mining) : 오피니언 마이닝이란 웹사이트와 소셜미디어에서 특정 주제에 대한 여론이나 정보를 수집, 분석해 평판을 도출하는 빅데이터 처리 기술이다.\n"
				+ "7.슈퍼 앱(Superapps) : 슈퍼 앱은 앱과 플랫폼, 생태계 기능을 하나의 애플리케이션에 통합한 새로운 종류의 플랫폼을 의미한다.\n"
				+ "8.블록체인(blockchain) : 블록체인은 온라인 금융 거래 정보를 블록으로 연결하여 피투피 네트워크 분산 환경에서 중앙 관리 서버가 아닌 참여자들의 개인 디지털 장비에 분산저장시켜 공동으로 관리하는 방식이다.\n"
				+ "9.디지털 면역 시스템(Digital Immune System) : 데이터를 바탕으로 IT 시스템 운영을 최적화, 자동화하면서, 시스템 장애 같은 갑작스러운 문제를 자동 해결하는 시스템을 구축하는 것이다.\n"
				+ "10.응용 관찰성(Applied Observability) : 응용 관찰성은 제품 생산 시스템의 동작과 성능을 이해하기 위해서 다양한 도구와 기술을 사용하는 것을 의미한다.\n");
	}

}
